Repository: MaratTazhetdinov/sea_battle
Catalog: lib/l10n/app_*.arb
Languages: ru

source: Sea Battle
ru: Морской бой

# createAccount
source: Create an account to join the battle
ru: Создайте аккаунт для того чтобы вступить в бой

source: Email
ru: Электронная почта

source: Password
ru: Пароль

source: Nickname
ru: Никнейм

# repeatPassword
source: Repeat your password
ru: Повторите пароль

source: Sign Up
ru: Регистрация

source: Sign In
ru: Вход

source: Already have an account?
ru: Есть аккаунт?

source: Sign In instead
ru: Войти в систему

source: Sign Up instead
ru: Зарегестрироваться

# invalidEmail
source: Invalid Email format
ru: Некорректный формат электронной почты

# invalidNickName
source: Nickname must contain at least 6 characters (only letters or digits)
ru: Никнейм должен состоять минимум из 6 символов (только буквы и цифры)

# invalidPassword
source: Password must contain at least 8 characters (at least 1 uppercase letter, 1 digit, and 1 special symbol)
ru: Пароль должен состоять как минимум из 8 символов (как минимум одна заглавная буква, 1 цифра и 1 специальный символ)

# invalidSecondPassword
source: This password does not match with the previous one
ru: Пароль не соответсвует предыдущему

# emptyFieldError
source: Field could not be empty
ru: Поле не может быть пустым

source: Sign In to an account
ru: Войдите в аккаунт

source: Do not have an account?
ru: Нет аккаунта?

# wrongPasswordError
source: Wrong password
ru: Неверный пароль

# invalidEmailError
source: Invalid Email format
ru: Неверный формат электронной почты

# userDisabledError
source: User is disabled
ru: Пользователь заблокирован

# userNotFoundError
source: User has not been found
ru: Пользователь не найден

# emailAlreadyInUseError
source: Email already in use
ru: Указанная электронная почта уже используется другим пользователем

# operationNotAllowedError
source: Operation has not been allowed
ru: Операция заблокирована

# weakPasswordError
source: Entered password is too weak
ru: Введенный пароль слишко слаб

# unexpectedError
source: Ooops... Unexpected error has occurred
ru: Ууупс... Возникла непредвиденная ошибка

# nicknameAlreadyInUseError
source: This nickname already in use
ru: Этот никнейм уже используется

source: Loading...
ru: Загрузка...

source: Line up your ships
ru: Расположите корабли

source: or
ru: или

source: Start Battle
ru: Вступить в бой
